# System Zone Element Type Dehumidification Set Point Property

Source: https://www.revitapidocs.com/2026/1919d11c-e2b2-849e-6e9a-06a2c9852563.htm

---

| System Zone Element Type Dehumidification Set Point Property |
| --- |

The humidification set point as a number between 0 and 1\.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double DehumidificationSetPoint { get; set; }
```

```
Public Property DehumidificationSetPoint As Double
	Get
	Set
```

```
public:
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
```

```
member DehumidificationSetPoint : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: |

See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace